#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_cloud_run_v2_service.my-service: Refreshing state... [id=projects/domestic-stock-checker-456208/locations/asia-northeast1/services/cloud-run-cicd-service]
google_cloud_run_v2_service_iam_binding.my-service-invoker-binding: Refreshing state... [id=projects/domestic-stock-checker-456208/locations/asia-northeast1/services/cloud-run-cicd-service/roles/run.invoker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.custom_domain will be created
  + resource "google_cloud_run_domain_mapping" "custom_domain" {
      + id       = (known after apply)
      + location = "asia-northeast1"
      + name     = "domestic-stock-checker.com"
      + project  = "domestic-stock-checker-456208"
      + status   = (known after apply)

      + metadata {
          + effective_annotations = (known after apply)
          + effective_labels      = {
              + "goog-terraform-provisioned" = "true"
            }
          + generation            = 0
          + namespace             = "domestic-stock-checker-456208"
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = {
              + "goog-terraform-provisioned" = "true"
            }
          + uid                   = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "cloud-run-cicd-service"
        }
    }

  # google_cloud_run_v2_service.my-service will be updated in-place
  ~ resource "google_cloud_run_v2_service" "my-service" {
        id                      = "projects/domestic-stock-checker-456208/locations/asia-northeast1/services/cloud-run-cicd-service"
        name                    = "cloud-run-cicd-service"
        # (33 unchanged attributes hidden)

      ~ template {
            # (10 unchanged attributes hidden)

          ~ containers {
              ~ image          = "asia-northeast1-docker.pkg.dev/domestic-stock-checker-456208/domestic-stock-checker/web:71612b863e7c6de0aa2d24d05ee2b21ef9dc1bb8" -> "asia-northeast1-docker.pkg.dev/domestic-stock-checker-456208/domestic-stock-checker/web:25532be9c9afdb6b81a1a77bae77aea356982fdd"
                name           = "web"
                # (6 unchanged attributes hidden)

                # (3 unchanged blocks hidden)
            }
          ~ containers {
              ~ image          = "asia-northeast1-docker.pkg.dev/domestic-stock-checker-456208/domestic-stock-checker/api:71612b863e7c6de0aa2d24d05ee2b21ef9dc1bb8" -> "asia-northeast1-docker.pkg.dev/domestic-stock-checker-456208/domestic-stock-checker/api:25532be9c9afdb6b81a1a77bae77aea356982fdd"
                name           = "app"
                # (6 unchanged attributes hidden)

                # (2 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Kubbo0308, Action: `pull_request`, Working Directory: ``, Workflow: `cicd`*